# Taps
tap "nikitabobko/tap"
tap "FelixKratz/formulae"

# Window Management & Status Bar
cask "aerospace"
brew "borders"
brew "sketchybar"

# Terminal & Multiplexer
cask "ghostty"
cask "wezterm"
brew "tmux"
brew "mosh"

# Shell Tools
brew "fzf"
brew "ripgrep"
brew "fd"
brew "bat"
brew "eza"

# File Management
brew "yazi"

# Git
brew "lazygit"
brew "gh"

# Networking / Tunnels
brew "cloudflared"

# Dev Tools
brew "fastfetch"
brew "cmake"
brew "openssl"
brew "neovim"
brew "lazydocker"

# Languages
brew "lua"
brew "go"
brew "python"
brew "node"
brew "corepack"

# Fonts
cask "font-fira-code-nerd-font"
